IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
// ===========================================================================
// SMP user interaction bridge (sdk-nrf-bm / Peer Manager port, S145).
//
// The SoftDevice owns the SMP exchange and surfaces the user steps as GAP
// events: BLE_GAP_EVT_PASSKEY_DISPLAY (Numeric Comparison when match_request is
// set, otherwise Passkey Entry display) and BLE_GAP_EVT_AUTH_KEY_REQUEST
// (Passkey Entry input). These are bridged to the same BtSmp* interaction API
// through sd_ble_gap_auth_key_reply. Strong reply functions below replace the
// generic weak implementations; an application replaces the weak UI functions.
// ===========================================================================

// SoftDevice passkey octets are six ASCII digits, most significant first.
// Convert to the six digit integer used by the BtSmp interaction API.
static uint32_t BmPasskeyToVal(const uint8_t *pAscii)
{
	uint32_t v = 0;
	for (int i = 0; i < BLE_GAP_PASSKEY_LEN; i++)
	{
		v = v * 10 + (uint32_t)(pAscii[i] - '0');
	}
	return v;
}

// Convert the six digit integer to six ASCII digits, most significant first,
// zero padded, for sd_ble_gap_auth_key_reply.
static void BmPasskeyFromVal(uint32_t Val, uint8_t *pAscii)
{
	for (int i = BLE_GAP_PASSKEY_LEN - 1; i >= 0; i--)
	{
		pAscii[i] = (uint8_t)('0' + (Val % 10));
		Val /= 10;
	}
}

// Resume Numeric Comparison. Confirm true reports a match (reply PASSKEY type
// with no key), false reports no match (reply NONE) and aborts pairing.
void BtSmpNumericComparisonReply(uint16_t ConnHdl, bool Confirm)
{
	(void)sd_ble_gap_auth_key_reply(ConnHdl,
			Confirm ? BLE_GAP_AUTH_KEY_TYPE_PASSKEY : BLE_GAP_AUTH_KEY_TYPE_NONE,
			NULL);
}

// Resume Passkey Entry on the input side. A value in 0..999999 is sent as six
// ASCII digits; a value above that range cancels with a NONE reply.
void BtSmpPasskeyReply(uint16_t ConnHdl, uint32_t Passkey)
{
	if (Passkey > 999999u)
	{
		(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
		return;
	}

	uint8_t ascii[BLE_GAP_PASSKEY_LEN];
	BmPasskeyFromVal(Passkey, ascii);
	(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, ascii);
}

// LE Secure Connections OOB data (strong overrides of the generic weak API).
// The IOsonata BtLesc module owns the SC key pair, so the local OOB set comes
// from it and the peer set is staged here; the peer data handler hands it to
// the pairing with the link peer address filled in.
static ble_gap_lesc_oob_data_t s_BtAppPeerOob;
static bool s_BtAppPeerOobValid = false;

typedef struct __Bt_Smp_Bm_Auth_Cfg {
	uint8_t IoCaps;
	uint8_t AuthReq;
	bool bSet;
} BtSmpBmAuthCfg_t;

static BtSmpBmAuthCfg_t s_BtSmpAuthCfg;

void BtSmpAuthConfig(uint8_t IoCaps, uint8_t AuthReq)
{
	if (IoCaps > BT_SMP_IOCAPS_KEYBOARD_DISPLAY)
	{
		return;
	}
	s_BtSmpAuthCfg.IoCaps = IoCaps;
	s_BtSmpAuthCfg.AuthReq = (uint8_t)(AuthReq | BT_SMP_AUTHREQ_SC);
	s_BtSmpAuthCfg.bSet = true;
}

static ble_gap_lesc_oob_data_t *BtAppOobPeerDataHandler(uint16_t ConnHdl)
{
	if (!s_BtAppPeerOobValid)
	{
		DEBUG_PRINTF("SEC: no OOB peer data, pairing will fail\r\n");
		return NULL;
	}

	BtDevice_t *pPeer = BtPeerFindByHdl(ConnHdl);
	if (pPeer != nullptr)
	{
		s_BtAppPeerOob.addr.addr_type = pPeer->Conn.PeerAddrType;
		memcpy(s_BtAppPeerOob.addr.addr, pPeer->Conn.PeerAddr, 6);
	}

	return &s_BtAppPeerOob;
}

int BtSmpOobLocalDataGen(BtHciDevice_t * const pDev, uint8_t * const pRand, uint8_t * const pConf)
{
	(void)pDev;

	if (pRand == NULL || pConf == NULL)
	{
		return -1;
	}
	if (!BtLescOobLocalGen())
	{
		return -1;
	}

	ble_gap_lesc_oob_data_t *p = BtLescOobLocalGet();
	if (p == NULL)
	{
		return -1;
	}

	memcpy(pRand, p->r, 16);
	memcpy(pConf, p->c, 16);

	return 0;
}

void BtSmpOobPeerDataSet(const uint8_t * const pRand, const uint8_t * const pConf)
{
	if (pRand == NULL || pConf == NULL)
	{
		return;
	}
	CryptoSecureWipe(&s_BtAppPeerOob, sizeof(s_BtAppPeerOob));
	memcpy(s_BtAppPeerOob.r, pRand, 16);
	memcpy(s_BtAppPeerOob.c, pConf, 16);
	s_BtAppPeerOobValid = true;
}

void BtSmpOobDataClear(void)
{
	s_BtAppPeerOobValid = false;
	CryptoSecureWipe(&s_BtAppPeerOob, sizeof(s_BtAppPeerOob));
}

// Weak defaults. With no application override the only safe action is to reject,
// so the user interaction cannot be performed silently. An application that can
// display or input overrides these.
__attribute__((weak)) void BtSmpNumericComparison(uint16_t ConnHdl, uint32_t Value)
{
	(void)Value;
	BtSmpNumericComparisonReply(ConnHdl, false);
}

__attribute__((weak)) void BtSmpPasskeyDisplay(uint16_t ConnHdl, uint32_t Passkey)
{
	(void)ConnHdl;
	(void)Passkey;
}

__attribute__((weak)) void BtSmpPasskeyRequest(uint16_t ConnHdl)
{
	BtSmpPasskeyReply(ConnHdl, BT_SMP_PASSKEY_INVALID);
}

// --- BLE event dispatch (registered as observer) ---

static void ble_evt_dispatch(const ble_evt_t *p_ble_evt, void *p_context)
{
	uint32_t err_code;
	const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;
	//uint8_t role = ble_conn_state_role(p_ble_evt->evt.gap_evt.conn_handle);
	uint8_t role = g_BtAppData.AppDevice.Conn.Role;

	DEBUG_PRINTF("evt: 0x%x\r\n", p_ble_evt->header.evt_id);
	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_CONNECTED:
			BtAppConnLedOn();
			BtPeerConnected(p_gap_evt->conn_handle, role,
							   p_gap_evt->params.connected.peer_addr.addr_type,
							   (uint8_t *)p_gap_evt->params.connected.peer_addr.addr);
			g_BtAppData.State = BTAPP_STATE_CONNECTED;
			BtAppEvtConnected(p_ble_evt->evt.gap_evt.conn_handle);

			// Start security from the main loop. Peer Manager and LESC work
			// must not run in the SoftDevice event interrupt.
			if (g_BtAppData.AppDevice.bSecure)
			{
				s_SecurePendingHdl = p_gap_evt->conn_handle;
			}
			break;

		case BLE_GAP_EVT_DISCONNECTED:
		{
			uint16_t connHdl = p_ble_evt->evt.gap_evt.conn_handle;
			BtDevice_t *pPeer = BtPeerFindByHdl(connHdl);

			if (s_SecurePendingHdl == connHdl)
			{
				s_SecurePendingHdl = BLE_CONN_HANDLE_INVALID;
			}
			BtSmpOobDataClear();
			BtAppConnLedOff();
			BtPeerFree(pPeer);

			if (BtPeerIsConnected() == false)
			{
				g_BtAppData.State = BTAPP_STATE_IDLE;
			}

