IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
bool BtAppIndicate(BtGattChar_t *pChar, uint8_t *pData, uint16_t DataLen)
{
	if (pChar == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && pData == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && BtGattCharSetValue(pChar, pData, DataLen) == false)
	{
		return false;
	}

	// Delegate to BtGattCharIndicate so the indication is tracked: pending flag,
	// transaction timeout, and TX-pending ring.
	return BtGattCharIndicate(BtAppGetConnHandle(), pChar, pData, DataLen);
}

// --- Disconnect ---

void BtAppDisconnect()
{
	if (BtAppGetConnHandle() != BLE_CONN_HANDLE_INVALID)
	{
		uint32_t err_code = sd_ble_gap_disconnect(
			BtAppGetConnHandle(),
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
		{
			DEBUG_PRINTF("BtAppDisconnect failed: 0x%x\r\n", err_code);
		}
	}
}

void BtAppGapDeviceNameSet(const char *pDeviceName)
{
	BtGapSetDevName(pDeviceName);
}

void BtAppEnterDfu()
{
	// Not supported on nRF54L15 S145 yet
	NVIC_SystemReset();
}

// --- DIS initialization ---

static void BtDisInit(const BtAppCfg_t *pCfg)
{
	// sdk-nrf-bm DIS uses Kconfig values for device info strings.
	// Call ble_dis_init() with security settings based on SecType.
	// Note: BLE_DIS_CONFIG_SEC_MODE_DEFAULT uses C nested designated
	// initializers (.device_info_char.read = ...) which are not valid
	// in C++. Initialize manually.
	struct ble_dis_config dis_cfg = {};
	dis_cfg.sec_mode.device_info_char.read.sm = 1;
	dis_cfg.sec_mode.device_info_char.read.lv = 1;

	switch (pCfg->SecType)
	{
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
		case BTGAP_SECTYPE_LESC_MITM:
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			// Just works / signed
			break;
		case BTGAP_SECTYPE_NONE:
		default:
			// Open access
			break;
	}

	ble_dis_init(&dis_cfg);
}

// --- Stack Init ---


__attribute__((weak)) void SoftdeviceFaultHandler(uint32_t id, uint32_t pc, uint32_t info)
{
	DEBUG_PRINTF("SoftDevice fault! ID %#x, PC %#x, Info %#x", id, pc, info);

	switch (id) {
	case NRF_FAULT_ID_SD_ASSERT:
		DEBUG_PRINTF("NRF_FAULT_ID_SD_ASSERT: SoftDevice assert");
		break;
	case NRF_FAULT_ID_APP_MEMACC:
		DEBUG_PRINTF("NRF_FAULT_ID_APP_MEMACC: Application bad memory access");
		if (info == 0x00) {
			DEBUG_PRINTF("Application tried to access SoftDevice RAM");
		} else {
			DEBUG_PRINTF("Application tried to access SoftDevice peripheral at %#x", info);
		}
		break;
	}

	for (;;) {
		/* loop */
	}
}

/* Extern in nrf_sdh.c (called directly at enable time for scheduler model) */
void SDBleRandSeed(uint32_t evt, void *ctx)
{
	uint32_t nrf_err;
	uint8_t seed[SD_RAND_SEED_SIZE];

	(void)ctx;

	if (evt == NRF_EVT_RAND_SEED_REQUEST)
	{
		if (nrfx_cracen_entropy_get(seed, sizeof(seed)) != 0)
		{
			return;
		}

		nrf_err = sd_rand_seed_set(seed);
		(void)nrf_err;
	}
}

static uint32_t SDBleDefaultCfgSet(const BtAppCfg_t *pCfg, uint32_t ConnCfgTag, uint32_t RamStart)
{
	uint32_t err = 0;
	ble_cfg_t ble_cfg;

	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.conn_cfg.conn_cfg_tag = ConnCfgTag;
	ble_cfg.conn_cfg.params.gap_conn_cfg.conn_count = pCfg->PeriLinkCount + pCfg->CentLinkCount; //CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT;
	ble_cfg.conn_cfg.params.gap_conn_cfg.event_length = CONFIG_NRF_SDH_BLE_GAP_EVENT_LENGTH;

	err = sd_ble_cfg_set(BLE_CONN_CFG_GAP, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_CONN_CFG_GAP, nrf_error %#x", err);

		return err;
	}

	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.gap_cfg.role_count_cfg.periph_role_count = pCfg->PeriLinkCount;

	// TODO: make this configurable
	ble_cfg.gap_cfg.role_count_cfg.adv_set_count = BLE_GAP_ADV_SET_COUNT_DEFAULT;

	ble_cfg.gap_cfg.role_count_cfg.central_role_count = pCfg->CentLinkCount;
	ble_cfg.gap_cfg.role_count_cfg.central_sec_count =
		MIN(pCfg->CentLinkCount, BLE_GAP_ROLE_COUNT_CENTRAL_SEC_DEFAULT);

	err = sd_ble_cfg_set(BLE_GAP_CFG_ROLE_COUNT, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_GAP_CFG_ROLE_COUNT, nrf_error %#x", err);

		return err;
	}

	// Max MTU
	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.conn_cfg.conn_cfg_tag = ConnCfgTag;
	ble_cfg.conn_cfg.params.gatt_conn_cfg.att_mtu = pCfg->MaxMtu > 0 ? pCfg->MaxMtu : CONFIG_NRF_SDH_BLE_GATT_MAX_MTU_SIZE;

	err = sd_ble_cfg_set(BLE_CONN_CFG_GATT, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_CONN_CFG_GATT, nrf_error %#x", err);

		return err;
	}

	// Custom UUID
	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.common_cfg.vs_uuid_cfg.vs_uuid_count = 2;//CONFIG_NRF_SDH_BLE_VS_UUID_COUNT;

	err = sd_ble_cfg_set(BLE_COMMON_CFG_VS_UUID, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_COMMON_CFG_VS_UUID, nrf_error %#x", err);

		return err;
	}

	// Configure the GATTS attribute table.
	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.gatts_cfg.attr_tab_size.attr_tab_size = CONFIG_NRF_SDH_BLE_GATTS_ATTR_TAB_SIZE;

	err = sd_ble_cfg_set(BLE_GATTS_CFG_ATTR_TAB_SIZE, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_GATTS_CFG_ATTR_TAB_SIZE, nrf_error %#x", err);

		return err;
	}

	// Configure Service Changed characteristic.
	memset(&ble_cfg, 0x00, sizeof(ble_cfg));
	ble_cfg.gatts_cfg.service_changed.service_changed =
		IS_ENABLED(CONFIG_NRF_SDH_BLE_SERVICE_CHANGED);

	err = sd_ble_cfg_set(BLE_GATTS_CFG_SERVICE_CHANGED, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_GATTS_CFG_SERVICE_CHANGED, nrf_error %#x", err);

		return err;
	}


	return err;
}

/**
 * @brief Initialize the SoftDevice BLE stack.
 *
 * In the bm framework, nrf_sdh.c handles the clock configuration
 * automatically from g_McuOsc, and nrf_sdh_ble.c handles the BLE
 * configuration from CONFIG_ defaults.  This function just
 * requests SD enable and then enables the BLE stack.
 */
bool BtAppStackInit(const BtAppCfg_t *pCfg)
{
	uint32_t err;

	DEBUG_PRINTF("BtAppStackInit: nrf_sdh_enable_request\r\n");

	uint32_t ramstart = (uint32_t)SystemRamStart();

	memset((void *)0x20000000, 0, ramstart - 0x20000000);

	// GRTC3 must be enabled with interrupt disbled before calling nrf_sdh_enable_request
	s_BtAppSdGrtc3.Init(s_BtAppSdTimerCfg);

	// Enable SoftDevice
	err = nrf_sdh_enable_request();
	if (err && err != -EALREADY)
	{
		DEBUG_PRINTF("nrf_sdh_enable_request failed: %d\r\n", err);
		return false;
	}

