IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	err = SDBleDefaultCfgSet(pCfg, BTAPP_CONN_CFG_TAG, ramstart);

	if (err != NRF_SUCCESS)
	{
		return false;
	}

	// Require before call to nrf_sdh_ble_enable
	SDBleRandSeed(NRF_EVT_RAND_SEED_REQUEST, NULL);

	DEBUG_PRINTF("BtAppStackInit: nrf_sdh_ble_enable\r\n");

	uint32_t ramreq = ramstart;

	err = sd_ble_enable(&ramreq);

	if (err != NRF_SUCCESS)
	{
		DEBUG_PRINTF("sd_ble_enable failed: 0x%x ramstart=0x%x ramreq=0x%x\r\n",
			err, ramstart, ramreq);
		return false;
	}

	if (ramreq > ramstart)
	{
		DEBUG_PRINTF("Insufficient RAM allocated for the SoftDevice need 0x%x\r\n", ramreq);
		return false;
	}

	// Pull nrf_sdh_ble.c from the static library. Its object contains the
	// ble_evt_poll stack observer that drains sd_ble_evt_get and dispatches
	// BLE events to Peer Manager and IOsonata observers.
	(void)nrf_sdh_ble_idx_get(BLE_CONN_HANDLE_INVALID);

	(void)sdh_state_evt_observer_notify(NRF_SDH_STATE_EVT_BLE_ENABLED);

	// Enable BLE stack (cfg_set from CONFIG_ defaults, handled in nrf_sdh_ble.c)
	//err = nrf_sdh_ble_enable(BTAPP_CONN_CFG_TAG);
	//if (err)
	//{
//		DEBUG_PRINTF("nrf_sdh_ble_enable failed: %d\r\n", err);
//		return false;
//	}

	// Initialize connection state tracking
	//ble_conn_state_init();

	return true;
}

// ---------------------------------------------------------------------------
// Secure Connections: peer_manager + BtLesc, mirroring the nRF52 SoftDevice
// port. The S145 SoftDevice owns the SMP state machine; peer_manager drives it
// and persists bonds (through the IOsonata bt_pds store), and the IOsonata
// BtLesc module performs the LESC ECDH. The application observes link security
// through these peer_manager events; no key material is surfaced to the app on
// this path (peer_manager is the authority), matching nRF52.
// ---------------------------------------------------------------------------

#define BT_APP_SEC_PARAM_MIN_KEY_SIZE	7
#define BT_APP_SEC_PARAM_MAX_KEY_SIZE	16

static void BtAppPmEvtHandler(const struct pm_evt *p_evt)
{
	// Standard peer_manager housekeeping: applies the event to internal state,
	// disconnects on security failure, and cleans flash on data update.
	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
		case PM_EVT_CONN_SEC_SUCCEEDED:
			BtSmpOobDataClear();
			// Link is encrypted. peer_manager holds the bond. Notify the app so
			// it can run work that needs an encrypted link (e.g. a central
			// reading protected characteristics). (nRF52 optionally enforces
			// MITM here; left permissive.)
			BtAppEvtSecured(p_evt->conn_handle);
			break;

		case PM_EVT_CONN_SEC_FAILED:
			BtSmpOobDataClear();
			// Security setup failed. pm_handler_disconnect_on_sec_failure above
			// already tears the link down when required.
			break;

		case PM_EVT_CONN_SEC_CONFIG_REQ:
		{
			// Allow an already-bonded peer to re-pair.
			struct pm_conn_sec_config cfg = { .allow_repairing = true };
			pm_conn_sec_config_reply(p_evt->conn_handle, &cfg);
		}
			break;

		case PM_EVT_STORAGE_FULL:
			// The IOsonata bt_pds store compacts itself on write, so unlike the
			// nRF52 fds_gc() path there is nothing to trigger here.
			break;

		case PM_EVT_PEERS_DELETE_SUCCEEDED:
			// Bonds cleared. Resume advertising if we are a peripheral.
			if (g_BtAppData.AppDevice.Conn.Role &
				(BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
			break;

		default:
			break;
	}
}

// Initialize peer_manager and LESC. Maps the app SecType / key-exchange config
// onto ble_gap_sec_params_t exactly as the nRF52 port does (the BTAPP_SECTYPE_*
// values alias the same BT_GAP_SECTYPE_* the nRF52 BLEAPP_SECTYPE_* use).
static uint32_t BtAppPeerMngrInit(BTGAP_SECTYPE SecType, uint8_t SecKeyExchg, bool bEraseBond)
{
	ble_gap_sec_params_t sec_param;
	uint32_t err_code;

	// Provide the LESC layer its ECDH engine BEFORE pm_init. pm_init ->
	// sm_init (the IOsonata bt_sec_bm security manager) calls BtLescInit, which
	// requires the engine to be injected at that point, else pairing has no
	// P-256 provider. The App owns the engine and injects it. On nRF54L15 the
	// P-256 hardware is the Silex BA414EP (Ba414ep), reached through the CRACEN
	// crypto interface the
	// same way a sensor reaches its bus. Its randomness for key generation and
	// blinding comes from the security-grade hardware RNG (CryptoRngNrf).
	static Ba414ep s_LescEcdh;
	Ba414ep *pLescEcdh = nullptr;
	if (s_LescEcdh.Init(CracenIntrfInstance(), CryptoRngNrfInstance()))
	{
		pLescEcdh = &s_LescEcdh;
		DEBUG_PRINTF("Crypto ECDH engine: Ba414ep (hardware P-256)\r\n");
	}
	else
	{
		// The P-256 engine did not come up. LE Secure Connections pairing
		// cannot run. Report it here rather than at the first pairing attempt.
		DEBUG_PRINTF("Crypto ECDH engine MISSING, LESC pairing will fail\r\n");
	}

	BtLescSetCryptoEngine(pLescEcdh);

	err_code = pm_init();
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_init failed: 0x%x\r\n", err_code);
		return err_code;
	}

	if (bEraseBond)
	{
		(void)pm_peers_delete();
	}

	memset(&sec_param, 0, sizeof(sec_param));

	sec_param.bond           = 1;
	sec_param.min_key_size   = BT_APP_SEC_PARAM_MIN_KEY_SIZE;
	sec_param.max_key_size   = BT_APP_SEC_PARAM_MAX_KEY_SIZE;
	sec_param.kdist_own.enc  = 1;
	sec_param.kdist_own.id   = 1;
	sec_param.kdist_peer.enc = 1;
	sec_param.kdist_peer.id  = 1;

	switch (SecType)
	{
		case BTGAP_SECTYPE_NONE:
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
			break;
		case BTGAP_SECTYPE_STATICKEY_MITM:
			sec_param.mitm = 1;
			break;
		case BTGAP_SECTYPE_LESC_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		default:
			break;
	}

	int exchg = SecKeyExchg & (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO);
	switch (exchg)
	{
		case BTAPP_SECEXCHG_KEYBOARD:
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;
		case BTAPP_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
			break;
		case (BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
			break;
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY):
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
		default:
			break;
	}

