IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	if (s_BtSmpAuthCfg.bSet)
	{
		sec_param.bond = (s_BtSmpAuthCfg.AuthReq &
						  BT_SMP_AUTHREQ_BONDING_FLAG_MASK) !=
						 BT_SMP_AUTHREQ_BONDING_FLAG_NO_BONDING;
		sec_param.mitm = (s_BtSmpAuthCfg.AuthReq & BT_SMP_AUTHREQ_MITM) != 0;
		sec_param.lesc = (s_BtSmpAuthCfg.AuthReq & BT_SMP_AUTHREQ_SC) != 0;
		sec_param.keypress = (s_BtSmpAuthCfg.AuthReq & BT_SMP_AUTHREQ_KEYPRESS) != 0;

		switch (s_BtSmpAuthCfg.IoCaps)
		{
			case BT_SMP_IOCAPS_DISPLAY_ONLY:
				sec_param.io_caps = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
				break;
			case BT_SMP_IOCAPS_DISPLAY_YESNO:
				sec_param.io_caps = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
				break;
			case BT_SMP_IOCAPS_KEYBOARD_ONLY:
				sec_param.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
				break;
			case BT_SMP_IOCAPS_KEYBOARD_DISPLAY:
				sec_param.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
				break;
			case BT_SMP_IOCAPS_NO_INPUT_NO_OUTPUT:
			default:
				sec_param.io_caps = BLE_GAP_IO_CAPS_NONE;
				break;
		}
	}

	if (SecKeyExchg & BTAPP_SECEXCHG_OOB)
	{
		sec_param.oob = 1;
	}

	err_code = pm_sec_params_set(&sec_param);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_sec_params_set failed: 0x%x\r\n", err_code);
		return err_code;
	}

	err_code = pm_register(BtAppPmEvtHandler);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_register failed: 0x%x\r\n", err_code);
		return err_code;
	}

	// LESC is initialized by the IOsonata security manager (bt_sec_bm.cpp)
	// inside pm_init -> sm_init, which owns the BtLesc key pair and injected
	// crypto engine. Only the staged peer OOB data routing is set up here, so
	// the SoftDevice receives it when it asks (LESC OOB association model).
	BtLescOobPeerHandlerSet(BtAppOobPeerDataHandler);

	return NRF_SUCCESS;
}

/**
 * @brief Initialize the Bluetooth application.
 *
 * This function initializes the SoftDevice, BLE stack, GAP parameters,
 * GATT services, advertising, and security.
 */
bool BtAppInit(const BtAppCfg_t *pCfg)
{
	uint32_t err_code;

	// Initialize application event handler
	if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem, pCfg->EvtHandlerQueMemSize) == false)
	{
		return false;
	}

	// Populate internal app data from config
	g_BtAppData.AppDevice.Conn.Role = pCfg->Role;
	g_BtAppData.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	if (!BtPeerInit(pCfg->pPeerPoolMem, pCfg->PeerPoolMemSize))
	{
		return false;
	}

	// Split the long-write reassembly pool across the peer slots so each
	// link gets its own buffer (per Conn.pLongWrBuff).
	BtPeerLongWrInit(pCfg->pLongWrPoolMem, pCfg->LongWrPoolMemSize);

	// Connection pool removed: the peer manager (BtPeerInit above) owns
	// the single connection table now.
	// bExtAdv is no longer a config field; BtAdvEncode determines extended vs
	// legacy from the encoded payload and sets g_BtAppData.bExtAdv during
	// BtAppAdvInit.
	g_BtAppData.ConnLedPort = pCfg->ConnLedPort;
	g_BtAppData.ConnLedPin = pCfg->ConnLedPin;
	g_BtAppData.ConnLedActLevel = pCfg->ConnLedActLevel;
	g_BtAppData.bScan = false;
	g_BtAppData.AppDevice.VendorId = pCfg->VendorId;
	g_BtAppData.AppDevice.ProductId = pCfg->ProductId;
	g_BtAppData.AppDevice.ProductVer = pCfg->ProductVer;
	g_BtAppData.AppDevice.Appearance = pCfg->Appearance;

	g_BtAppData.AppDevice.Conn.MaxMtu = GATT_MTU_SIZE_DEFAULT;
	if (pCfg->MaxMtu > GATT_MTU_SIZE_DEFAULT)
		g_BtAppData.AppDevice.Conn.MaxMtu = pCfg->MaxMtu;

	// Setup connection LED
	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
	{
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
					IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);
		BtAppConnLedOff();
	}

	// Initialize SoftDevice + BLE stack
	if (BtAppStackInit(pCfg) == false)
	{
		DEBUG_PRINTF("BtAppStackInit failed\r\n");
		return false;
	}


	// Set GAP appearance
	err_code = sd_ble_gap_appearance_set(pCfg->Appearance);
	(void)err_code;

	// Initialize GAP parameters
	BtGapCfg_t gapcfg = {
		.Role = pCfg->Role,
		.SecType = pCfg->SecType,
		.AdvInterval = pCfg->AdvInterval,
		.AdvTimeout = pCfg->AdvTimeout,
		.ConnIntervalMin = pCfg->ConnIntervalMin,
		.ConnIntervalMax = pCfg->ConnIntervalMax,
		.SlaveLatency = BT_GAP_CONN_SLAVE_LATENCY,
		.SupTimeout = BT_GAP_CONN_SUP_TIMEOUT
	};

	BtGapInit(&gapcfg);

	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// Register connection parameters event handler
	ble_conn_params_evt_handler_set(on_conn_params_evt);

	// Initialize user services
	DEBUG_PRINTF("BtAppInit: Role=0x%x PERIPHERAL=%d\r\n",
		pCfg->Role, (pCfg->Role & BTAPP_ROLE_PERIPHERAL) ? 1 : 0);
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		DEBUG_PRINTF("BtAppInit: calling BtAppInitUserServices\r\n");
		BtAppInitUserServices();
	}

	// Initialize Device Information Service
	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit(pCfg);
	}

	// Initialize user data
	BtAppInitUserData();

	g_BtAppData.AppDevice.bSecure = pCfg->SecType != BTGAP_SECTYPE_NONE;

	// Initialize Secure Connections (peer_manager + LESC) when the app
	// requests security. Bonds persist through the IOsonata bt_pds store.
	if (g_BtAppData.AppDevice.bSecure)
	{
		// No erase-bond flag in BtAppCfg_t; bonds are preserved across init.
		// A dedicated clear (pm_peers_delete / BtSmpBondClearAll) can be added
		// as a separate API if forced re-bonding is needed.
		if (BtAppPeerMngrInit(pCfg->SecType, pCfg->SecExchg, false) != NRF_SUCCESS)
		{
			DEBUG_PRINTF("BtAppPeerMngrInit failed\r\n");
			return false;
		}
	}

	// Initialize advertising
	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		if (BtAppAdvInit(pCfg) == false)
		{
			DEBUG_PRINTF("BtAppAdvInit failed\r\n");
			return false;
		}

		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_ADV,
			g_BtAppData.AdvHdl,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}
	else
	{
		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_SCAN_INIT,
			0,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}

	g_BtAppData.State = BTAPP_STATE_INITIALIZED;

	DEBUG_PRINTF("BtAppInit: success\r\n");

	return true;
}

/**
 * @brief Main BLE application run loop.
 *
 * Starts advertising (if peripheral/broadcaster) then enters the
 * main event loop.  SoftDevice events are dispatched through the
 * observer infrastructure triggered by the SD_EVT interrupt.
 */
// Millisecond clock for the generic SMP/GATT transaction timeouts, overriding
// the weak BtSmpMsTick/BtGattMsTick defaults. The RTC/timer is owned by the
// SDK + SoftDevice; this reads the free-running GRTC3 count via the s_BtAppSdGrtc3
// handle the port enables as a SoftDevice prerequisite (a read is
// non-destructive). Declared in bt_smp.h / bt_gatt.h, so no linkage specifier is
// needed here.
uint32_t BtSmpMsTick(void)
{
	return s_BtAppSdGrtc3.mSecond();
}

