IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
uint32_t BtGattMsTick(void)
{
	return s_BtAppSdGrtc3.mSecond();
}

// Spec-strict indication transaction timeout: Core Vol 3 Part F 3.3.3 requires
// closing the bearer, so disconnect the link. Overrides the generic weak
// default that only clears the outstanding-indication flag.
void BtGattIndicationTimeout(uint16_t ConnHdl)
{
	sd_ble_gap_disconnect(ConnHdl, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void BtAppRun()
{
	if (g_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		BtAdvStart();
	}

	DEBUG_PRINTF("BtAppRun: entering main loop\r\n");

	while (1)
	{
		uint16_t connHdl = BLE_CONN_HANDLE_INVALID;
		uint32_t intState = DisableInterrupt();

		if (s_SecurePendingHdl != BLE_CONN_HANDLE_INVALID)
		{
			connHdl = s_SecurePendingHdl;
			s_SecurePendingHdl = BLE_CONN_HANDLE_INVALID;
		}

		EnableInterrupt(intState);

		if (connHdl != BLE_CONN_HANDLE_INVALID)
		{
			uint32_t err = pm_conn_secure(connHdl, false);
			DEBUG_PRINTF("pm_conn_secure hdl=%u returned 0x%08" PRIx32 "\r\n",
				connHdl, err);
		}

		// Process any pending LESC DHKey computation. Required for LE Secure
		// Connections: BtLesc defers the ECDH to be run from the main loop
		// rather than the BLE event context.
		if (g_BtAppData.AppDevice.bSecure)
		{
			(void)BtLescRequestHandler();
		}

		AppEvtHandlerExec();

		// The S145 port uses Peer Manager for SMP. Only the generic GATT
		// indication timeout remains here.
		BtGattIndicationTimeoutCheck();

		BtAppEvtWait();
	}
}

// Port-level weak default for BtAppEvtWait. Bare-metal apps use __WFE.
// RTOS apps override with sem take in their bridge code.
__attribute__((weak)) void BtAppEvtWait(void)
{
	if (BtPeerIsConnected())
	{
		msDelay(BTAPP_TIMEOUT_POLL_MS);
	}
	else
	{
		__WFE();
	}
}

// Drains queued SoftDevice stack events by running the registered observers.
// Effect: pending stack events are delivered to their handlers. Precondition:
// SoftDevice enabled. Called from an RTOS BtAppEvtWait override after the
// waiter unblocks, so observers run in task context. Returns void.
void BtAppEvtDispatch()
{
	nrf_sdh_evts_poll();
}

static void soc_evt_poll(void *context)
{
	uint32_t nrf_err;
	uint32_t evt_id;

	DEBUG_PRINTF("soc_evt_poll\r\n");
	while (true) {
		nrf_err = sd_evt_get(&evt_id);
		if (nrf_err) {
			break;
		}

		/* Forward the event to SoC observers. */
		TYPE_SECTION_FOREACH(
			struct nrf_sdh_soc_evt_observer, nrf_sdh_soc_evt_observers, obs) {
			obs->handler(evt_id, obs->context);
		}
	}

	__ASSERT(nrf_err == NRF_ERROR_NOT_FOUND,
		 "Failed to receive SoftDevice SoC event, nrf_error %#x", nrf_err);
}

/*
 * BLE event pumping is handled by the SDK nrf_sdh_ble.c ble_evt_poll, which is
 * registered as NRF_SDH_STACK_EVT_OBSERVER(ble_evt_obs, ...). That function
 * maintains the connection-handle index table (idx_assign on CONNECTED,
 * idx_unassign on DISCONNECTED) that nrf_sdh_ble_idx_get / peer_manager
 * conn_state rely on, then fans the event out to all NRF_SDH_BLE_OBSERVERs.
 * IOsonata's own GAP/GATT handling is one such observer (ble_evt_dispatch,
 * registered below). A second pump here would also drain sd_ble_evt_get and
 * fan out without the idx tracking, leaving nrf_sdh_ble_idx_get returning -1,
 * so it is intentionally not defined.
 */

/* Auto-handle seed requests as a SoC event observer */
NRF_SDH_SOC_OBSERVER(rand_seed, SDBleRandSeed, NULL, HIGH);
/* SoftDevice SoC event pump (BLE pump is the SDK nrf_sdh_ble.c one) */
NRF_SDH_STACK_EVT_OBSERVER(soc_evt_obs, soc_evt_poll, NULL, HIGHEST);
/* IOsonata GAP/GATT handling, driven by the SDK BLE event fan-out */
NRF_SDH_BLE_OBSERVER(s_BtAppBleObserver, ble_evt_dispatch, NULL, USER);



// =====================================================================
// Central / Observer role
// ---------------------------------------------------------------------
// BtAppScanInit programs the scan parameters and arms the first scan.
// BtAppScan continues an in-flight scan (after each ADV_REPORT) or
// starts a fresh one if scanning was idle.
// BtAppScanStop halts scanning.
// BtAppConnect issues a GAP connect request using the parameters that
// were set up by the most recent BtAppScanInit call.
// =====================================================================


bool BtAppConnect(BtGapPeerAddr_t * const pPeerAddr, BtGapConnParams_t * const pConnParam)
{
	// SD requires scanning to be stopped before issuing a connect.
	g_BtAppData.bScan = false;

	return BtGapConnect(pPeerAddr, pConnParam);
}

// =====================================================================
// Central GATT client discovery (S145 SoftDevice path)
// ---------------------------------------------------------------------
// S145 owns the host. There is no BtHciDevice_t, so the ATT engine in
// bt_attreq.cpp / bt_attrsp.cpp does not apply here. Discovery runs on
// sd_ble_gattc_*_discover and the matching BLE_GATTC_EVT_* responses.
//
// Sequence: all primary services, then characteristics per service, then
// descriptors per characteristic to resolve the CCCD handle. On completion
// BtDeviceDiscovered(pDev) is called (weak default in bt_app.cpp, overridden
// by the app).
//
// Single active discovery at a time. The cursor lives in file-scope statics,
// not per peer, so concurrent central links are not supported yet. Per-link
// discovery would move this cursor into pDev->Discovery.
// =====================================================================

static BtDevice_t *s_pDiscDev    = NULL;    // peer under discovery
static uint8_t     s_DiscSrvIdx  = 0;       // service cursor (char and desc phases)
static uint8_t     s_DiscCharIdx = 0;       // characteristic cursor (desc phase)

static void BtAppDiscStartChar(BtDevice_t *pDev);
static void BtAppDiscStartDesc(BtDevice_t *pDev);

bool BtAppDiscoverDevice(BtDevice_t * const pDev)
{
	if (pDev == NULL)
	{
		return false;
	}

	s_pDiscDev    = pDev;
	s_DiscSrvIdx  = 0;
	s_DiscCharIdx = 0;

	pDev->NbSrvc = 0;
	memset(pDev->Services, 0, sizeof(BtGattDBSrvc_t) * BT_DEV_SERVICE_MAXCNT);

	// NULL uuid filter discovers every primary service from handle 1.
	return sd_ble_gattc_primary_services_discover(pDev->Conn.Hdl, 0x0001, NULL) == NRF_SUCCESS;
}

static void BtAppDiscStartChar(BtDevice_t *pDev)
{
	while (s_DiscSrvIdx < pDev->NbSrvc)
	{
		BtGattDBSrvc_t *pSrvc = &pDev->Services[s_DiscSrvIdx];
		ble_gattc_handle_range_t range;

		range.start_handle = pSrvc->handle_range.StartHdl + 1;  // skip service declaration
		range.end_handle   = pSrvc->handle_range.EndHdl;

		if (range.start_handle <= range.end_handle &&
		    sd_ble_gattc_characteristics_discover(pDev->Conn.Hdl, &range) == NRF_SUCCESS)
		{
			return;     // wait for BLE_GATTC_EVT_CHAR_DISC_RSP
		}
		s_DiscSrvIdx++; // empty service or request rejected; advance
	}

